**LINEAR REGRESSION - REAL ESTATE ANALYSIS**

In [74]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import pearsonr

In [75]:
data1=pd.read_excel("Linear Regression.xlsx")
data1.head(2)

    price  sqft_living  bedrooms  bathrooms  floors
0  221900         1180         3       1.00     1.0
1  538000         2570         3       2.25     2.0

In [77]:
data1.describe()

              price   sqft_living      bedrooms     bathrooms        floors
count  2.161300e+04  21613.000000  21613.000000  21613.000000  21613.000000
mean   5.400881e+05   2079.899736      3.370842      2.114757      1.494309
std    3.671272e+05    918.440897      0.930062      0.770163      0.539989
min    7.500000e+04    290.000000      0.000000      0.000000      1.000000
25%    3.219500e+05   1427.000000      3.000000      1.750000      1.000000
50%    4.500000e+05   1910.000000      3.000000      2.250000      1.500000
75%    6.450000e+05   2550.000000      4.000000      2.500000      2.000000
max    7.700000e+06  13540.000000     33.000000      8.000000      3.500000

In [79]:
x=data1.iloc[:,:1]
x.head()

    price
0  221900
1  538000
2  180000
3  604000
4  510000

In [85]:
y1=data1.iloc[:,4:]
y1.head()

   floors
0     1.0
1     2.0
2     1.0
3     1.0
4     1.0

In [92]:
y2=data1.iloc[:,1:2]
y2.head()

   sqft_living
0         1180
1         2570
2          770
3         1960
4         1680

In [91]:
y3=data1.iloc[:,3:4]
y3.head()

   bathrooms
0       1.00
1       2.25
2       1.00
3       3.00
4       2.00

In [93]:
y4=data1.iloc[:,2:3]
y4.head()

   bedrooms
0         3
1         3
2         2
3         4
4         3

In [106]:
from sklearn.model_selection import train_test_split
x_train,x_test,y1_train,y1_test=train_test_split(x,y1,test_size=0.2,random_state=2)
x_train,x_test,y2_train,y2_test=train_test_split(x,y2,test_size=0.2,random_state=2)
x_train,x_test,y3_train,y3_test=train_test_split(x,y3,test_size=0.2,random_state=2)
x_train,x_test,y4_train,y4_test=train_test_split(x,y4,test_size=0.2,random_state=2)

In [104]:
from sklearn.linear_model import LinearRegression
lg=LinearRegression()

between price and floors

In [115]:
print(lg.coef_)
print(lg.intercept_)

[[7.70125623e-07]]
[2.95061418]

In [117]:
ypred=lg.predict(x_test)
ypred

array([[3.51665652],
       [3.83625865],
       [3.22054321],
       ...,
       [3.25670061],
       [3.23941129],
       [3.11080031]])

In [120]:
from sklearn.metrics import r2_score
r_square=r2_score(y_test,ypred)
r_square

-11.915162081056488

In [122]:
#since we are forceing our regression line through a specific point by taking a specific feature i.e. no of floors, the value of r sqaure is in negative

between price and sqft_living

In [108]:
lg.fit(x_train,y2_train)
print(lg.coef_)
print(lg.intercept_)

[[0.00174633]]
[1131.43277126]

between price and number of bathrooms

In [110]:
lg.fit(x_train,y3_train)
print(lg.coef_)
print(lg.intercept_)

[[1.10105199e-06]]
[1.5185242]

between price and no of bedrooms

In [111]:
lg.fit(x_train,y4_train)
print(lg.coef_)
print(lg.intercept_)

[[7.70125623e-07]]
[2.95061418]

**LOGISTIC REGRESSION-BANK LAON MODELLING**

In [1]:
import pandas as pd

In [2]:
dataset=pd.read_excel("Bank_Personal_Loan_Modelling.xlsx", sheet_name=1)

In [3]:
dataset.head(2)

   ID  Age  Experience  ...  CD Account  Online  CreditCard
0   1   25           1  ...           0       0           0
1   2   45          19  ...           0       0           0

[2 rows x 14 columns]

In [6]:
dataset.drop(['ZIP Code', 'ID' ], axis=1)

      Age  Experience  Income  ...  CD Account  Online  CreditCard
0      25           1      49  ...           0       0           0
1      45          19      34  ...           0       0           0
2      39          15      11  ...           0       0           0
3      35           9     100  ...           0       0           0
4      35           8      45  ...           0       0           1
...   ...         ...     ...  ...         ...     ...         ...
4995   29           3      40  ...           0       1           0
4996   30           4      15  ...           0       1           0
4997   63          39      24  ...           0       0           0
4998   65          40      49  ...           0       1           0
4999   28           4      83  ...           0       1           1

[5000 rows x 12 columns]

In [8]:
Y=dataset['Personal Loan']

In [12]:
X=dataset[['Age','Experience','Income','Family','CCAvg','Education','Mortgage','Securities Account','CD Account','Online','CreditCard']]

In [17]:
import statsmodels.api as sm
X1=sm.add_constant(X)

In [18]:
logistic=sm.Logit(Y,X1)

In [19]:
result=logistic.fit()

Optimization terminated successfully.
         Current function value: 0.128435
         Iterations 9

In [20]:
result.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                           Logit Regression Results
==============================================================================
Dep. Variable:          Personal Loan   No. Observations:                 5000
Model:                          Logit   Df Residuals:                     4988
Method:                           MLE   Df Model:                           11
Date:                Mon, 17 Aug 2020   Pseudo R-squ.:                  0.5938
Time:                        08:54:08   Log-Likelihood:                -642.18
converged:                       True   LL-Null:                       -1581.0
Covariance Type:            nonrobust   LLR p-value:                     0.000
======================================================================================
                         coef    std err          z      P>|z|      [0.025      0.975]
--------------------------------------------------------------------------------------
const                -12.1928      1.645     -7.411      0.000     -15.417      -8.968
Age                   -0.0536      0.061     -0.874      0.382      -0.174       0.067
Experience             0.0638      0.061      1.046      0.295      -0.056       0.183
Income                 0.0546      0.003     20.831      0.000       0.049       0.060
Family                 0.6958      0.074      9.364      0.000       0.550       0.841
CCAvg                  0.1240      0.040      3.127      0.002       0.046       0.202
Education              1.7362      0.115     15.088      0.000       1.511       1.962
Mortgage               0.0005      0.001      0.856      0.392      -0.001       0.002
Securities Account    -0.9368      0.286     -3.277      0.001      -1.497      -0.377
CD Account             3.8225      0.324     11.800      0.000       3.188       4.457
Online                -0.6752      0.157     -4.298      0.000      -0.983      -0.367
CreditCard            -1.1197      0.205     -5.462      0.000      -1.522      -0.718
======================================================================================
"""

Inference:
* Age,Experience,Income,Family,Education,Securities Account,CD Account,Online and CreditCard are the most significant factors when compared to other factors for deciding if bank loan can be given to a person or not
* with p-value<0.05, CCAvg is also affecting to some extent for sanctioning loan.
* after applying the values of all the independent varaibles over the logistic regressiion formula , if the p>0.5, then there are high chances of the loan getting sanctioned

**LOGISTIC REGRESSION- ATTRITION PROBLEM**

In [63]:
data=pd.read_csv("general_data.csv")
data.head(2)

   Age Attrition  ... YearsSinceLastPromotion YearsWithCurrManager
0   51        No  ...                       0                    0
1   31       Yes  ...                       1                    4

[2 rows x 24 columns]

In [64]:
data.dropna(inplace=True)
data.shape

(4382, 24)

In [65]:
data = data.drop(columns = ['EmployeeID', 'EmployeeCount', 'Over18', 'StandardHours', ])

In [66]:
from sklearn import preprocessing
le = preprocessing.LabelEncoder()
data['Attrition'] = le.fit_transform(data['Attrition'])
data['BusinessTravel'] = le.fit_transform(data['BusinessTravel'])
data['EducationField'] = le.fit_transform(data['EducationField'])
data['Gender'] = le.fit_transform(data['Gender'])
data['Department'] = le.fit_transform(data['Department'])
data['MaritalStatus'] = le.fit_transform(data['MaritalStatus'])
data['JobRole'] = le.fit_transform(data['JobRole'])

In [67]:
Y1 = data['Attrition']
X1 = data.drop(columns = ['Attrition'])

In [68]:
import statsmodels.api as sm
X2=sm.add_constant(X1)

In [69]:
logistics=sm.Logit(Y1,X2)

In [72]:
result=logistics.fit()

Optimization terminated successfully.
         Current function value: 0.392916
         Iterations 7

In [73]:
result.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                           Logit Regression Results
==============================================================================
Dep. Variable:              Attrition   No. Observations:                 4382
Model:                          Logit   Df Residuals:                     4362
Method:                           MLE   Df Model:                           19
Date:                Mon, 17 Aug 2020   Pseudo R-squ.:                  0.1093
Time:                        09:25:23   Log-Likelihood:                -1721.8
converged:                       True   LL-Null:                       -1933.1
Covariance Type:            nonrobust   LLR p-value:                 8.681e-78
===========================================================================================
                              coef    std err          z      P>|z|      [0.025      0.975]
-------------------------------------------------------------------------------------------
const                       0.0270      0.414      0.065      0.948      -0.785       0.839
Age                        -0.0307      0.007     -4.478      0.000      -0.044      -0.017
BusinessTravel             -0.0137      0.066     -0.209      0.834      -0.143       0.115
Department                 -0.2229      0.082     -2.735      0.006      -0.383      -0.063
DistanceFromHome           -0.0012      0.005     -0.231      0.818      -0.012       0.009
Education                  -0.0664      0.043     -1.555      0.120      -0.150       0.017
EducationField             -0.0954      0.034     -2.849      0.004      -0.161      -0.030
Gender                      0.0855      0.090      0.952      0.341      -0.091       0.262
JobLevel                   -0.0285      0.040     -0.716      0.474      -0.107       0.050
JobRole                     0.0400      0.018      2.226      0.026       0.005       0.075
MaritalStatus               0.5835      0.063      9.212      0.000       0.459       0.708
MonthlyIncome           -1.815e-06   9.57e-07     -1.897      0.058   -3.69e-06    6.01e-08
NumCompaniesWorked          0.1174      0.018      6.390      0.000       0.081       0.153
PercentSalaryHike           0.0126      0.012      1.067      0.286      -0.011       0.036
StockOptionLevel           -0.0675      0.052     -1.302      0.193      -0.169       0.034
TotalWorkingYears          -0.0584      0.012     -4.873      0.000      -0.082      -0.035
TrainingTimesLastYear      -0.1443      0.035     -4.097      0.000      -0.213      -0.075
YearsAtCompany              0.0132      0.018      0.718      0.473      -0.023       0.049
YearsSinceLastPromotion     0.1328      0.020      6.479      0.000       0.093       0.173
YearsWithCurrManager       -0.1394      0.022     -6.288      0.000      -0.183      -0.096
===========================================================================================
"""

Inference:
* Age,MaritalStatus,NumCompaniesWorked,TotalWorkingYears,TrainingTimesLastYear,YearsSinceLastPromotion and YearsWithCurrManager are the most significant factors when compared to other factors for deciding if bank loan can be given to a person or not
* with p-value<0.05, Department,EducationField,JobRole are also affrecting the decision to a certain extent
* after applying the values of all the independent varaibles over the logistic regressiion formula , if the p>0.5, then there are high chances of attrition by the employee